#include <iostream>
using namespace std;
/*
3 : 1,3,2
4 = 1,3,2,4
5 = 1,3,2,4,5
7 = 1,3,2,4,5,7
4의 배수 : 1,3,2,4 / 5,7,6,8 / 9,11,10,12 등으로 i=1부터 i,i+1,i-1,i로 출력하면 됨.
나머지1,3일 경우 : 똑같이 1,3,2,4 / 5,7,6,8 / 9,11,10,12 등으로 i=1부터 i,i+1,i-1,i로 출력이 가능.

6 = 2,1,3,4 / 6,5
10 = 2,1,3,4 / 6,5,7,8 / 10,9
나머지 2일 경우 : i+1,i-1,i,i+1 반복한다.
*/
int dr[4] = {0,0,1,-1}; // 나머지0,1,3
int dr2[4] = {0,1,-1,0}; // 나머지2

int main() {
    ios::sync_with_stdio(false);
    cin.tie(0);
    int n;
    cin>>n;
    cout<<"YES"<<'\n';
    if (n%4!=2) {
        for (int i=1;i<=n;++i) {
            cout<<i+dr[i%4]<<' ';
        }
    }
    else {
        for (int i=1;i<=n;++i) {
            cout<<i+dr2[i%4]<<' ';
        }
    }
}